[ 연산 ] 
- 원칙 : 같은 위치에 있는 원소 단위
- 조건 : 같은 행과 컬럼 같아야함
- 특징 : NaN이 있으면 연산X

[1] 모듈 로딩 & 데이터 준비 <hr>

In [38]:
# [1-1] 모듈 로딩
import pandas as pd     # 데이터 분석과 전처리를 위한 모듈
import numpy as np      # 배열(array)을 python으로 구현한 모듈

In [39]:
# [1-2] 데이터 준비
data1 = {'A': [10,20,np.nan, 40],
         'B': [5,15,25,40],}


data2 = {'A': [4,5,27, 32],
         'B': [52,5,25,40],
         'C': [7,7,7,7]}

[2] 데이터 생성 및 확인 <hr>

In [40]:
## - DF생성
df1 = pd.DataFrame( data1 )
df2 = pd.DataFrame( data2 )

In [41]:
# - DF 확인
df1.info(),
print("=================\n\n\n")
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      float64
 1   B       4 non-null      int64
dtypes: float64(1), int64(1)
memory usage: 192.0 bytes
=================



<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      int64
 1   B       4 non-null      int64
 2   C       4 non-null      int64
dtypes: int64(3)
memory usage: 224.0 bytes

[3] 연산 - 산술연산 <hr>

In [42]:
# [3-1] DataFrame + 정수

df1+10

      A   B
0  20.0  15
1  30.0  25
2   NaN  35
3  50.0  50

In [43]:
# [3-2] DataFrame.연산메서드(정수, fill_value = 원하는 값)

df1.add(10, fill_value=0)
df1.sub(10, fill_value=0)
df1.mul(10, fill_value=0)
df1.div(10, fill_value=0)

     A    B
0  1.0  0.5
1  2.0  1.5
2  0.0  2.5
3  4.0  4.0

In [44]:
# [3-3] 시리즈 정수연산

sr1 = df1['A']
sr2 = df1['B']

sr1 +10

0    20.0
1    30.0
2     NaN
3    50.0
Name: A, dtype: float64

In [45]:
# [3-4] DataFrame 과 DataFrame, Series 와 Series 연산
# 같은 위치에 값이 모두 NaN 이면 계산 X
df1.add(df1, fill_value=0)

      A   B
0  20.0  10
1  40.0  30
2   NaN  50
3  80.0  80

In [46]:
# 한쪽만 NaN 이면 fill_value 로 값을 채움
sr1.add(sr2, fill_value=0)

0    15.0
1    35.0
2    25.0
3    80.0
dtype: float64

In [47]:
# DataFrame => shape 속성 : DataFrame 에 행과 열의 개수
row  = df2.shape[0] # 행의 수
cols = df2.shape[1] # 열의 수

In [48]:
# DataFrame 특정 행 과 열에서 추출 해서 연산 ==> Series
row0 = df2.loc[0,['A','B']]
row3 = df2.loc[3,['A','B']]

#df2.loc[3,['A','B']] =row0 + row3

In [49]:
df2.loc[df2.shape[0]] = row0 + row3 
df2[df2.shape[1]] = row0 + row3 
df2

      A     B    C   3
0   4.0  52.0  7.0 NaN
1   5.0   5.0  7.0 NaN
2  27.0  25.0  7.0 NaN
3  32.0  40.0  7.0 NaN
4  36.0  92.0  NaN NaN

[4] 연산 - 비교연산 <hr>

In [50]:
# [4-1] Series 와 정수 비교 연산
sr1 >= 5

0     True
1     True
2    False
3     True
Name: A, dtype: bool

[5] 논리 연산자 ==> 결과 Bool , 여러개 조건을 연산 수행

- 모든 조건 만족해야 하는 연산자 &                  <===> Python의 and
- 1개 이상 조건 만족하면 되는 연산자 |              <===> Python의 or
- 현재 결과를 반대로 해주는 연산자 ~                <===> Python의 not

In [52]:
# CSV => DataFrame 로딩

D_File = '../DATA/member.csv'


memDF = pd.read_csv(D_File)
memDF

   번호   이름  나이  지역
0   1  홍길동  20  대구
1   2  이나영  12  서울
2   3  최희진  22  마산
3   4  마징가  31  부산
4   5  박지민  17  대구
5   6  김나나  25  서울
6   7  박서희  33  광주

In [55]:
# 번호가 짝수인 데이터만 추출 => %2 나머지 0 이면 짝수 ===> 짝수, 1 --- 홀수

memDF['번호'] % 2 == 0

0    False
1     True
2    False
3     True
4    False
5     True
6    False
Name: 번호, dtype: bool

In [56]:
memDF[ memDF['번호'] % 2 == 0 ]

   번호   이름  나이  지역
1   2  이나영  12  서울
3   4  마징가  31  부산
5   6  김나나  25  서울